#### Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.ct_config.ignition will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "ignition" {
      + content      = (known after apply)
      + files_dir    = "./.."
      + id           = (known after apply)
      + pretty_print = false
      + rendered     = (known after apply)
      + strict       = true
    }

  # null_resource.regenerate_key must be replaced
-/+ resource "null_resource" "regenerate_key" {
      ~ id       = "4678173910117897086" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "bootstrap_config_hash" = "e7b8ca501b0f8e41e64bef678e67dfb58f4e183cb2796d71ec11e939248f5d93" -> "29c3d3be31ee56303cb6539abedf040c97ea1605eb4243309153bb44106bdb61"
          ~ "ignition_config_hash"  = "0374ce9127d63b30bc793391aa2a75e76d27d8b7dfba2ecdb16d7ad9c302adf9" -> "a51adce188493aaf34da64c5b54a1763bd571217b91b590e12f2f24b13efe851"
            # (10 unchanged elements hidden)
        }
    }

  # oci_core_instance.this must be replaced
-/+ resource "oci_core_instance" "this" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.uk-london-1.abwgiljtyydap6ps4r5hntkljsr6jnh46gzlzlyvso2ba7gon7tnd3vqfj2a" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/terraform" -> null
          - "Oracle-Tags.CreatedOn" = "2026-03-27T11:29:54.776Z" -> null
            # (3 unchanged elements hidden)
        }
      ~ extended_metadata                   = {} -> (known after apply)
      ~ fault_domain                        = "FAULT-DOMAIN-3" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      + hostname_label                      = (known after apply)
      ~ id                                  = "ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7acaandzi2umb3j3sqzk6krker4tf67vukhlsqthe77tjxq" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.uk-london-1.aaaaaaaaze7uoavoo7lblhkq4rzfclpwrrfoubqvqiprstvqtpvi4j4ymfka" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_ai_enterprise_enabled            = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "user_data" = "eyJpZ25pdGlvbiI6eyJjb25maWciOnsicmVwbGFjZSI6eyJ2ZXJpZmljYXRpb24iOnt9fX0sInByb3h5Ijp7fSwic2VjdXJpdHkiOnsidGxzIjp7fX0sInRpbWVvdXRzIjp7fSwidmVyc2lvbiI6IjMuNC4wIn0sImtlcm5lbEFyZ3VtZW50cyI6e30sInBhc3N3ZCI6e30sInN0b3JhZ2UiOnsiZGlyZWN0b3JpZXMiOlt7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvcmVwbyIsInVzZXIiOnt9LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9lbnYiLCJ1c2VyIjp7fSwibW9kZSI6NDkzfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvc2NyaXB0cyIsInVzZXIiOnt9LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy9vY2ktdmF1bHQiLCJ1c2VyIjp7fSwibW9kZSI6NDQ4fSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvcmNsb25lIiwidXNlciI6e30sIm1vZGUiOjQ0OH0seyJncm91cCI6e30sInBhdGgiOiIvZXRjL2J1Y2tldCIsInVzZXIiOnt9LCJtb2RlIjo0NDh9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zZWNyZXRzIiwidXNlciI6e30sIm1vZGUiOjQ0OH1dLCJmaWxlcyI6W3siZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy90bXBmaWxlcy5kL29jaS1hcHBzLmNvbmYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixkJTIwJTJGcnVuJTJGc2VjcmV0cyUyMDA3MDAlMjByb290JTIwcm9vdCUyMC0lMEEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDIwfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvbG9jYWxlLmNvbmYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixMQU5HJTNEQy5VVEYtOCUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0MjB9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy96aW5jYXRpL2NvbmZpZy5kLzU1LXVwZGF0ZS1zdHJhdGVneS50b21sIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvelROTWFyRE1BeUE0VjJuRUpvZndhOTBLbVR0MXFtRkRzRUVVNHRFME5qQmxnbTVmVkVnMDRlRTBEKzBOUWJsNnFGcUNjclRqajNTeWtWeWxBOEJET2RGZHk2N1RWTE1tL2NRdzE2eHh3SHBrUlA5SWIwYUcyK094elEzNDE3RWVBWTlhSW5RYXFIb3FMS3c5ZHoxNWh6Qmw5T2s4N2hJYXNyMitmL2k0QmNBQVAvLytxMmRnS0lBQUFBPSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0MjB9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy9vY2ktdmF1bHQvY29uZmlnIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvNXpQdTI2c01CZ0U0SDdmWlpFNDNLcFRyQWdGMGlxSmdDUWwrckh4d21MOFkrTWJmdm9vU1JtbDJhbEcwM3lhOTh2YnRldmJxbXlxcnErZit2SmFWODlmN1QrU21jYVJCY1AxUGhJMTZnaEpISm5sekZGUUZPYzRnaFcrNC9nVW9BREFrSkdKU2o1NkE4ZU5IRXNXRHBxendTU1UwWDNMQlIrVWRXWXVWQWFuUCtDZjRRRThHelZMdVZiclBkejlNQk1aN0N3S1NLWjEwNGovVE02VWwrWW1DcmZLWDNoVHRWMWQ5cStYdHYxNGFSNzVubkxuV0lGcTJJR2d0WDR4ZHRpTlRBUkpOM0JlemNFak9jTENmQzVQbndFQUFQLy83dHplNUhVQkFBQT0iLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6Mzg0fSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvcmNsb25lL3JjbG9uZS5jb25mIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosJTVCb2NpLWJhY2t1cCU1RCUwQXR5cGUlMjAlM0QlMjBvcmFjbGVvYmplY3RzdG9yYWdlJTBBcHJvdmlkZXIlMjAlM0QlMjBpbnN0YW5jZV9wcmluY2lwYWxfYXV0aCUwQW5hbWVzcGFjZSUyMCUzRCUyMGxya3kwZjFubW90cyUwQXJlZ2lvbiUyMCUzRCUyMHVrLWxvbmRvbi0xJTBBbm9fY2hlY2tfYnVja2V0JTIwJTNEJTIwdHJ1ZSUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjozODR9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy9idWNrZXQvY29uZmlnIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosQlVDS0VUX05BTUUlM0RvY2ktYXBwcyUwQU9DSV9OQU1FU1BBQ0UlM0Rscmt5MGYxbm1vdHMlMEEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6Mzg0fSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvc2NyaXB0cy9maXJzdC1ib290LnNoIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvM3lSd1dvYlFReUc3L3NVcXR0VFlYWVBLUTBVU2cvdXhSQUlOTDJGWU1hejJ0MGhNeU5WMHJweHlNT1gzY1IyV0V4dmcvVFBKL0hwNDRkbUYwdXo4enBVaWdZT1J3S09qSjJQcWFvd0RBU3JuL1MzSlBKdExEMzg5akZwOEFucnVsNVZZWlFFcnRPN0d4ak1XTDgxRFQvMld0c3BGU2czYW42WHNEa1Z0OGticW0yOTVLOWZhdXVmd1JFMGx2a2NtYXFWZVFIMzlOeGQ2SUZiejlVcThLSzcvWHgrLzZmVlFqT3FOSW1DVDdPQ1NqSTR1VGhyU1huVGNsSUJzYWo1TkVHTmx0elYwZUxtTlRSSjVJTU5WSzRjUjU0MUNtZEhhb0luRkRqbm1kUEJwYmpIOS9rTHROdjFCdFkzRy9DbEJhWTIrK0lDWlNaOXZSRkh2bnFIWmNFdVBuMC9id2tVb2dzcEx2NGVCNjBIREkvVG1JNEVidTlnNUhhNjNuTHZrWHZ4TGNMTEM5emZ3NmNmNFBBUFhGL0R3OE1SOUFzejdTY1FNUmJWd1NuS0htVUpvajJLeEJaQnBqd3UwbWZZanNnbW1oSE1waUFNdnZSdmkrbEJEWE93QkRJSHEzOEJBQUQvL3hDYzM1dm9BZ0FBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NjcmlwdHMvZmV0Y2gtY29uZmlnLnNoIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvNFJWWVcvYk5oUCt6bDl4THlQZ1RkcEtTcnB2N2J6QlRUT3NXTm9HYVFwczJBYURvazRTWjRwa3lWTWNyK2gvSHlSUnRsdzR5Q2ZwSGo3MzhIaDNQSjc4THkrVXlRc1JHaGFRSU1YT2dsTU9LNkUwWSsrWHY2K1dkM2RYNzIvdVBpMWVuck8zVjlmTFB4WS9uTE0zbnk5L3U3cGJmVmkrdjFydzVJTFBnVTgzeThzZWZjbFo3N2w2Kys1MndYTnFYVzZsU3FVMWxhclQwbTZNdHFMazdQYnE1dVBxOCszMWdqZEVMcnpLODFwUjB4V1p0RzFlQ0ZKR1NmSHY0Q3VjQzFtdEtEcU53dFpSN3RIWkhTT3V2cmxkZnJqOGRjRXJGTlI1ekowdHBRZ1VPR1BUNXF1Tm9tYmxrYnpDY0hvR1h4bUF0bEpvY0I0cjliQklMblpJaVlFV3ljdWRMWWl3ZGJTNFlBeWdYWmZLUStxQUp6MlBNd0RmUXVvcjRNbVVBMzdJMjhNTVlOTW9qWEI2T3FuQ2p3dVk1eDdPemw1RGFSa0FBTXJHQWw5R1loSTk4bVRPZndWdjR4R1ZxU0VaVHdOa0lZWTNDUFgxZm83RHI1VUtiQUJiL0lPU29PajBlbGNnK0d0Z0FLU3A2S2dCWlFJSkkzSGx2REpTT2FGbkRDTmFERTVJQko1ODN4Rjh4aXM2dVVZYTZJZk1PU2xHeldQNDg2VXB1TFJQNXl5WE00cTlSNy94aXNZRGpqVUxKS2dMaStUbjNmbFRISE9oS3ZnVGtuRWRVdndDNS9EM2E2QUdUUlFjQ0drNTJ5emZ4WFhJQkpBT1VuK00rU3oyUjg0anQxTHg1MmkzREF0SW5UZHd6aUo5aW5iV0t6OGQ2WlZaUEdPLy9DS1V4aEpFUmVqaG9GY21uVEJ0aVErSzRPSmd3MUZqNmltb0JyRVhmWEIrMjNlWU1wQjhIWWJEdDVCbDJhZ1VOS0tEWklBSFlCL3o4K2R3ZHNZQVNtdVFmV01zeG9na20xNXVuQkdkRjZTc2djcmJGajVldm9PeGF3Yjk0MWNZK09pWmYrbEVxWkZDem9IblNES1gxcEJRQm4zSXd6WVF0aVYvUWlMU2RncVRQWDZmOGxhbVVrRkpvZU84RzJTOHRaUm4zek9la2lJdnNGTHJSNFhpK2xNeW9pUHJNWkNTanlydEtYd3F5YVcycHErSWNFNHJPZGFqSDdaQmtmWGJvUlN6bVhaYUtoL3Y5RFNnK1JsbnRTS1EyaHJzYnk0NmF1Q2lud0ZlR05sTTFIRmE4OG44Zkh2TjV5cE1HMGpEREpsVmxNUHdCdXdCeHZwVFdJL1NHa2h2NFpFT09NWTZyREpqNDFlU2hsSmdhMDNxc1UveGZBR05LRFJDM1VpZmtsMmp5WnlnNWdnalRZM2REQk9xOGhnYUg4TEFIQkNuaFZtTHZXMFVFZnE5N2JIVXF0amJXcGk2RXpXU3RYcW1FcCs0UFNLY1N3c2gxNTNMU0xYb2Q2RHpuY0VaTnJtbVVxTXdCL1Jha1hVaERWc2pSNVN4RTdpT0FkeFpxNkVSQVl5RmQxTkxRMERwa2NJTENCWTZvOVVhd1ZLREhnTDZleVV4Z0NMWVdQTi9nZ0xaQ1pCWGRZMGVTeWkySUdDTXZ6TTlTY1NaTU5RNDZ1YlBNalQzR1h3aTRhbVhLcFZIU1hxYnNaTWh6V21oclZ5RHVMZXFEREFZdlFZMUNJVzFCTElSeXNSWDkrb0I1U0IwNHhHbU94VEExRjYwSVh1c2pMTmREbW9SRDdpN1A0ZVRyQjl3SUczck5CSnk5bDhBQUFELy94d0lHSWgrQ1FBQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zY3JpcHRzL2ZldGNoLWJvb3RzdHJhcC1zZWNyZXRzLnNoIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvN3lVUVc4YVB4REY3LzRVODEvUVA4bkIwRlpWYzZnYUthSkVRb3FhQ2lnNXBCSHkyclBzaUYxN2E0OUxxZmp3MVdaM2FRbVZjcUluMEhqZTc4MGJXOXY3YjVpU0hhWXE1Q0lnZzhUb29LSUtNMFdGRUQyNFFkWTVCTlFlT1VBTVpGZEFOckN5R3FIeVpEVlZxb0J6NjBCN05HaVpWQkhBSWhvMEYySjBPeGwvbWk4bkh6LzB6NTJtUGFqNWxXbTBwa0JZSWNOWEFTQ2xpcHp2K2N2Zi9PYTBWWkdCcEwrNC9uSTdYODdHbyttNDVpLzNUa25iL0MyaTM4S1pVYXdHeVlHZjFNNHlXazRHN1orelZ1TFZScnJJVldUWVFhb0N2bnNMMGx5SUxrYmo5cStpTklWVHhKbU9aL1BKYVBuNWVqYTd2NXVlL202ZStaMGlVZzhXcWlDakdQYzVOdWdSc3ZyOW9oR1V3Y01EeUorUTlQOTRLYnZkUWFuYmVGYyttdnZ4OFQxd2psWUFBS0RPSFNRM2lnbzB3SzZ4MnJ0bjNwVndONXJBUXNXQ0U3ajYvMDJqK2tFTXIwVkc5Y3ozbmhocmJZbWw4MXVaS3IydVlXV1ZCZGdRUCtHaVI2alFseFFDT2R1U09VY0lyRHlMV0txd2hsZVhsNkpjRy9JZ0t4ajZhSWZ0SU9KcFRHa1BnMThkOUF6SlpoUklxMExxZ3REVzEzaXM2N2J6a3JZNUVBM2dMMHQ4cHZjWW1MU3NWQWdiNTAybm05WGhtcTlOeDFjcnREd1lEQklSdG9HeDFGdzBPd0FwclpOcDRmVDZxRDJnLzA0YWo3QnpyekNqOVVzNGJ0czZ6SzhBQUFELy8yT1dNS0V4QlFBQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zY3JpcHRzL2dpdG9wcy1zeW5jLnNoIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvMlNSd1c0VFBSU0Y5MzZLRS8ralgxVENNVlJpQTBxbGtBNmtVbWlxYVdGVG9jajFYTWNXN3RpeVBVRVY1ZDNSWk5xMDBMVjl2bnUrZS8rYnlCdlh5UnVWTGN0VUlLZ1BpQzZTVWM0ejF0UVg2ODNwV1RQak1zUWlFOFVnZzNaQ3haZzUrOWpNenhmTEdUZWtTcDlJeHRCcWxVdm1iTG5ZMU9mZkhsS1pkS0tTcFNYbGk5V1c5QS9SSjUrbjFPMDRZN29Gcng0SGNiWjFCWWFLdGdqSmJWMEhYbzF6T0dPcjlXSyttbFd2aGorSmRpS3FsQW5MZW41NnhKcjZ5L3FxZnZISVI0cDhoQnd4NWd5dXdhczlqR015MjQ4ZndoemZQNkJZNmhqZ0RDWVlVTEgzSGtJWUkwTG43MTZVd3ZHSmJHa251OTc3UXhnZ2JRUDRKNVdMTUNIOVZLbkZzRkZxWDhNSHJUeXN5bWpkanRLV1dwZ1VidkYzMFNrYXlsU0s2N1pUanBQL2ovZlkwVzEvS0dFSDZMOTZERENPR2ZkZ0tReDROUjdqdVZ3T2ZkTDA5RFQ2WGtNTVlyK1dpODNuczZ2MXhlWG1hN042TDM0L1R3SzZUeDdDNUV1SVc3eDlBeUVTbFhTSGR4QUJoMVdNN0NjTXgvMDlTdXJwVVBCUEFBQUEvLzlmazBmTGVnSUFBQT09IiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NjcmlwdHMvZnJlc2hyc3MtY2FjaGUtd2FybS5zaCIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6Imd6aXAiLCJzb3VyY2UiOiJkYXRhOjtiYXNlNjQsSDRzSUFBQUFBQUFDLzRTUjMwL2lUaFRGMytldk9NNFhyWnJ2ZEFEakM0cUpXZW91V2QwZll1S0Q2NUtCdWFXTlphWTdNMVVpOEw5dktJTDR0UGVwYWM0OTU1N1AvTGNuUjdtUkkrVXo1aWxBVUdWUjVpV2xLaThZNjEzZVhRNTcvZHN1bDdZTVVxdWdaT3JJWjg1N09iWW16U2V5OHVROFo0T2YxLzI3Wk5pL3VmeWNkTG0yNHlkeWNXNmxLc3Jja1BSL2lqeFE1eVErYmNWdHp0aUV3akFsMHY3d0NITUdBR2x1TkhoakU4a2hwbXFtcVF3WjJoQkdUUW1SSHNWcm93aDdFS1VLR2FKak9aVEhFVVRwY2hPYWFGOUlUYy9TVkVXQkJYN1YxaTlaWGhENlY0TXVIQ2tONFNBMG9naDZkQVp0YTgxcVNxdW55c0JWQmtLNEtjUXplR091Ujh1TzNDWjNuUDMvbFlNM2Rndnp0NkROdk12QkI4bDE4dWtPbFN0d2RmdjlCcXZXdVArUzNDYjF2K3YrMXdUUi9sUTlVVm9WUmFCWldDbjJJLzZ4eWdMQlZWU25hR3VJTFJtN1NwTGVvTnM0M0xMRUF0NjZBRkZoZ1ltakV0SHZMSVF5MnF3ZnNZY0hpRmZ3UnIzTDhmaUlnd1BNUWVQTWduK3oyTnpndk1mYU03V1YwZndNTk1zRG1tZFlNclpXM3lzM3pjMEVqY09YTVVTQjgvUHpyZkhSZWptT1k4NVlhaDJHeUEzbXJUZythUzYzek45NDA0ekdINExIS3pEQ3AxZ2QzNUd5c0dOVlpOWUhtUnROczdqTVN1eXdhVjhjdEZZMVJvN1VVMjNzQzZJU0xWYVRZalBsSmg3aXh5bEVmNzc4VitxMDFXNkN6NWNjd21JMzVQMTd0K24yWmQ2bzlLd2h6djRHQUFELy80Rk9oNU5ZQXdBQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9lbnYvZnJlc2hyc3MuZW52IiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosRlJFU0hSU1NfSE9TVCUzRHJzcy5kY3Uuc2glMEFGVUxMVEVYVFJTU19IT1NUJTNEZnRyLmRjdS5zaCUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0MjB9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9lbnYvcGxhbmthLmVudiIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LFBMQU5LQV9IT1NUJTNEcGxhbmthLmRjdS5zaCUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0MjB9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9lbnYvbml0dGVyLmVudiIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LE5JVFRFUl9IT1NUJTNEbml0dGVyLmRjdS5zaCUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0MjB9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9lbnYvcmVkbGliLmVudiIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LFJFRExJQl9IT1NUJTNEcmVkbGliLmRjdS5zaCUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0MjB9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9lbnYvbGFuZ3VhZ2V0b29sLmVudiIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LExBTkdVQUdFVE9PTF9IT1NUJTNEbHQuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9wb2RseS5lbnYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixQT0RMWV9IT1NUJTNEcG9kbHkuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NjcmlwdHMvbGFuZ3VhZ2V0b29sLW5ncmFtcy5zaCIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6Imd6aXAiLCJzb3VyY2UiOiJkYXRhOjtiYXNlNjQsSDRzSUFBQUFBQUFDLzFUT1Qwc0RNUkFGOFB0OGlqR1czbVpuSzRnaTlDRCtZNkdLMUpzaU1tdXkyMkNhaENTTHhVOHZ1RkoyenpQdnZkL3BDYmZXY3l0NUI5a1VKRE1FakRhYVRxd0RlSHJZWGo5KzNEYmJ0ZUlRQzJzcHdrNThQMGh2U2dpT2ZaOWtueFc4TnMvM3plWnVyUmJIREZmR1Z6ODJLb0EzSkkzVGsvRUszM0c1UkhPd0JXdUEvWmUyQ1NsT3Z4VEE1NUFjVXZleVFRcW9GdjhyQ3RXdWxKaXZlSWFwUXVwWmgyL3ZndWhSUm4vaUVVbkcwMW05T3E4dlZ4ZWpxODI2U0VJNmROTnV1cGtqZmdNQUFQLy9nN1RRNFNRQkFBQT0iLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDkzfV0sImZpbGVzeXN0ZW1zIjpbeyJkZXZpY2UiOiIvZGV2L3NkYiIsImZvcm1hdCI6InhmcyIsImxhYmVsIjoiYXBwcy1kYXRhIiwicGF0aCI6Ii92YXIvb3B0L2RhdGEiLCJ3aXBlRmlsZXN5c3RlbSI6ZmFsc2V9XX0sInN5c3RlbWQiOnsidW5pdHMiOlt7ImNvbnRlbnRzIjoiIyBHZW5lcmF0ZWQgYnkgQnV0YW5lXG5bVW5pdF1cblJlcXVpcmVzPXN5c3RlbWQtZnNja0BkZXYtc2RiLnNlcnZpY2VcbkFmdGVyPXN5c3RlbWQtZnNja0BkZXYtc2RiLnNlcnZpY2VcblxuW01vdW50XVxuV2hlcmU9L3Zhci9vcHQvZGF0YVxuV2hhdD0vZGV2L3NkYlxuVHlwZT14ZnNcblxuW0luc3RhbGxdXG5SZXF1aXJlZEJ5PWxvY2FsLWZzLnRhcmdldCIsImVuYWJsZWQiOnRydWUsIm5hbWUiOiJ2YXItb3B0LWRhdGEubW91bnQifSx7ImVuYWJsZWQiOnRydWUsIm5hbWUiOiJwb2RtYW4uc29ja2V0In0seyJjb250ZW50cyI6IltVbml0XVxuRGVzY3JpcHRpb249Rmlyc3QgYm9vdCBpbml0aWFsaXphdGlvbiAodXBkYXRlcyArIFNTSCByZW1vdmFsKVxuQWZ0ZXI9bmV0d29yay1vbmxpbmUudGFyZ2V0XG5XYW50cz1uZXR3b3JrLW9ubGluZS50YXJnZXRcbkNvbmRpdGlvbkZpcnN0Qm9vdD15ZXNcblxuW1NlcnZpY2VdXG5UeXBlPW9uZXNob3RcbkV4ZWNTdGFydD0vb3B0L3NjcmlwdHMvZmlyc3QtYm9vdC5zaFxuXG5bSW5zdGFsbF1cbldhbnRlZEJ5PW11bHRpLXVzZXIudGFyZ2V0XG4iLCJlbmFibGVkIjp0cnVlLCJuYW1lIjoiZmlyc3QtYm9vdC5zZXJ2aWNlIn0seyJjb250ZW50cyI6IltVbml0XVxuRGVzY3JpcHRpb249VGFpbHNjYWxlIERhZW1vblxuQWZ0ZXI9bmV0d29yay1vbmxpbmUudGFyZ2V0IGZpcnN0LWJvb3Quc2VydmljZVxuV2FudHM9bmV0d29yay1vbmxpbmUudGFyZ2V0XG5cbltTZXJ2aWNlXVxuU3RhbmRhcmRPdXRwdXQ9am91cm5hbCtjb25zb2xlXG5TdGFuZGFyZEVycm9yPWpvdXJuYWwrY29uc29sZVxuRXhlY1N0YXJ0PS91c3IvbG9jYWwvYmluL3RhaWxzY2FsZWQgLS1zdGF0ZT0vdmFyL2xpYi90YWlsc2NhbGUvdGFpbHNjYWxlZC5zdGF0ZVxuUmVzdGFydD1vbi1mYWlsdXJlXG5SZXN0YXJ0U2VjPTVcblxuW0luc3RhbGxdXG5XYW50ZWRCeT1tdWx0aS11c2VyLnRhcmdldFxuIiwiZW5hYmxlZCI6dHJ1ZSwibmFtZSI6InRhaWxzY2FsZWQuc2VydmljZSJ9LHsiY29udGVudHMiOiJbVW5pdF1cbkRlc2NyaXB0aW9uPUF1dGhlbnRpY2F0ZSBUYWlsc2NhbGUgKGlmIG5vdCBhbHJlYWR5IGF1dGhlbnRpY2F0ZWQpXG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXQgdGFpbHNjYWxlZC5zZXJ2aWNlXG5XYW50cz1uZXR3b3JrLW9ubGluZS50YXJnZXRcblJlcXVpcmVzPXRhaWxzY2FsZWQuc2VydmljZVxuXG5bU2VydmljZV1cblR5cGU9b25lc2hvdFxuU3RhbmRhcmRPdXRwdXQ9am91cm5hbCtjb25zb2xlXG5TdGFuZGFyZEVycm9yPWpvdXJuYWwrY29uc29sZVxuRXhlY1N0YXJ0PS9iaW4vYmFzaCAtYyAnXFxcbiAgaWYgL3Vzci9sb2NhbC9iaW4vdGFpbHNjYWxlIHN0YXR1cyAtLWpzb24gMlx1MDAzZS9kZXYvbnVsbCB8IGdyZXAgLXEgXCJcXFwiQmFja2VuZFN0YXRlXFxcIjpcXFwiUnVubmluZ1xcXCJcIjsgdGhlbiBcXFxuICAgIGVjaG8gXCJUYWlsc2NhbGUgYWxyZWFkeSBhdXRoZW50aWNhdGVkXCI7IFxcXG4gIGVsc2UgXFxcbiAgICBlY2hvIFwiQXV0aGVudGljYXRpbmcgVGFpbHNjYWxlLi4uXCI7IFxcXG4gICAgL3Vzci9sb2NhbC9iaW4vdGFpbHNjYWxlIHVwIC0tYXV0aC1rZXk9XCJ0c2tleS1hdXRoLWtHOGpta2NNOHIxMUNOVFJMLWhjRnhxRVNTUTVLUEJ2TUhTWnBqN0toOHRNVUZHcjMzOVwiIC0tc3NoIC0tYWNjZXB0LXJvdXRlczsgXFxcbiAgZmknXG5SZW1haW5BZnRlckV4aXQ9eWVzXG5cbltJbnN0YWxsXVxuV2FudGVkQnk9bXVsdGktdXNlci50YXJnZXRcbiIsImVuYWJsZWQiOnRydWUsIm5hbWUiOiJ0YWlsc2NhbGUtYXV0aC5zZXJ2aWNlIn0seyJjb250ZW50cyI6IltVbml0XVxuRGVzY3JpcHRpb249RmV0Y2ggY29uZmlndXJhdGlvbiBmcm9tIE9DSSBidWNrZXRcbkFmdGVyPW5ldHdvcmstb25saW5lLnRhcmdldCBmaXJzdC1ib290LnNlcnZpY2UgdGFpbHNjYWxlLWF1dGguc2VydmljZSB2YXItb3B0LWRhdGEubW91bnRcbldhbnRzPW5ldHdvcmstb25saW5lLnRhcmdldFxuUmVxdWlyZXM9Zmlyc3QtYm9vdC5zZXJ2aWNlIHZhci1vcHQtZGF0YS5tb3VudFxuQmVmb3JlPWZldGNoLWJvb3RzdHJhcC1zZWNyZXRzLnNlcnZpY2VcbkNvbmRpdGlvblBhdGhFeGlzdHM9IS9ldGMvZmV0Y2gtY29uZmlnLWNvbXBsZXRlXG5cbltTZXJ2aWNlXVxuVHlwZT1vbmVzaG90XG5TdGFuZGFyZE91dHB1dD1qb3VybmFsK2NvbnNvbGVcblN0YW5kYXJkRXJyb3I9am91cm5hbCtjb25zb2xlXG5FbnZpcm9ubWVudEZpbGU9L2V0Yy9idWNrZXQvY29uZmlnXG5FeGVjU3RhcnQ9L29wdC9zY3JpcHRzL2ZldGNoLWNvbmZpZy5zaCAke0JVQ0tFVF9OQU1FfSAke09DSV9OQU1FU1BBQ0V9XG5FeGVjU3RhcnRQb3N0PS91c3IvYmluL3RvdWNoIC9ldGMvZmV0Y2gtY29uZmlnLWNvbXBsZXRlXG5SZW1haW5BZnRlckV4aXQ9eWVzXG5cbltJbnN0YWxsXVxuV2FudGVkQnk9bXVsdGktdXNlci50YXJnZXRcbiIsImVuYWJsZWQiOnRydWUsIm5hbWUiOiJmZXRjaC1jb25maWcuc2VydmljZSJ9LHsiY29udGVudHMiOiJbVW5pdF1cbkRlc2NyaXB0aW9uPUZldGNoIGJvb3RzdHJhcCBzZWNyZXRzIGZyb20gT0NJIFZhdWx0XG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXQgZmlyc3QtYm9vdC5zZXJ2aWNlIGZldGNoLWNvbmZpZy5zZXJ2aWNlXG5XYW50cz1uZXR3b3JrLW9ubGluZS50YXJnZXRcblJlcXVpcmVzPWZldGNoLWNvbmZpZy5zZXJ2aWNlXG5CZWZvcmU9aW5maXNpY2FsLWFnZW50LnNlcnZpY2VcblxuW1NlcnZpY2VdXG5UeXBlPW9uZXNob3RcblN0YW5kYXJkT3V0cHV0PWpvdXJuYWwrY29uc29sZVxuU3RhbmRhcmRFcnJvcj1qb3VybmFsK2NvbnNvbGVcbkVudmlyb25tZW50RmlsZT0vZXRjL29jaS12YXVsdC9jb25maWdcbkV4ZWNTdGFydD0vb3B0L3NjcmlwdHMvZmV0Y2gtYm9vdHN0cmFwLXNlY3JldHMuc2hcblJlbWFpbkFmdGVyRXhpdD15ZXNcblxuW0luc3RhbGxdXG5XYW50ZWRCeT1tdWx0aS11c2VyLnRhcmdldFxuIiwiZW5hYmxlZCI6dHJ1ZSwibmFtZSI6ImZldGNoLWJvb3RzdHJhcC1zZWNyZXRzLnNlcnZpY2UifV19fQ=="
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "172.16.0.30" -> (known after apply)
      + public_ip                           = (known after apply)
      ~ region                              = "uk-london-1" -> (known after apply)
      ~ security_attributes                 = {} -> (known after apply)
      ~ security_attributes_state           = "STABLE" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.uk-london-1.aaaaaaaaocb6yhiygivj4tq5yfhsyyyefivkbtmd3vtiaws5mlhu5ni2bcvq" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2026-03-27 11:29:55.421 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config (known after apply)
      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null
        }

      ~ availability_config (known after apply)
      - availability_config {
          - is_live_migration_preferred = false -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          - assign_private_dns_record = false -> null
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/terraform"
              - "Oracle-Tags.CreatedOn" = "2026-03-27T11:29:54.903Z"
              - "terraform.managed"     = "terraform"
              - "terraform.name"        = "oci-apps"
              - "terraform.repo"        = "https://github.com/batinicaz/oci-apps"
            } -> (known after apply)
          ~ display_name              = "oci-apps" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          + hostname_label            = (known after apply)
          ~ private_ip                = "172.16.0.30" -> (known after apply)
          + private_ip_id             = (known after apply)
          ~ security_attributes       = {} -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + subnet_cidr               = (known after apply)
          + vlan_id                   = (known after apply)
            # (3 unchanged attributes hidden)

          ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ launch_volume_attachments (known after apply)

      ~ licensing_configs (known after apply)

      ~ placement_constraint_details (known after apply)

      ~ platform_config (known after apply)

      ~ preemptible_instance_config (known after apply)

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 4 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 4 -> (known after apply)
          ~ nvmes                         = 0 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
          + resource_management           = (known after apply)
          ~ vcpus                         = 4 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          ~ boot_volume_vpus_per_gb         = "10" -> (known after apply)
          - is_preserve_boot_volume_enabled = false -> null
            # (4 unchanged attributes hidden)

          ~ instance_source_image_filter_details (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # oci_core_volume_attachment.data must be replaced
-/+ resource "oci_core_volume_attachment" "data" {
      ~ availability_domain                 = "xykJ:UK-LONDON-1-AD-3" -> (known after apply)
      + chap_secret                         = (known after apply)
      + chap_username                       = (known after apply)
      ~ compartment_id                      = "ocid1.compartment.oc1..aaaaaaaafuvd3pcfan7vltla4vfklid2z55au5dasf4r5kkxykif3gzfyxaa" -> (known after apply)
      + device                              = (known after apply)
      ~ display_name                        = "volumeattachment20260327113039" -> (known after apply)
      + encryption_in_transit_type          = (known after apply)
      ~ id                                  = "ocid1.volumeattachment.oc1.uk-london-1.anwgiljtwlhza7acw4ufxfgtgh7bevgmt5ojqemiiowjqcykm6iopk6yjspq" -> (known after apply)
      ~ instance_id                         = "ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7acaandzi2umb3j3sqzk6krker4tf67vukhlsqthe77tjxq" -> (known after apply) # forces replacement
      + ipv4                                = (known after apply)
      + ipv6                                = (known after apply)
      + iqn                                 = (known after apply)
      + is_agent_auto_iscsi_login_enabled   = (known after apply)
      + is_multipath                        = (known after apply)
      ~ is_read_only                        = false -> (known after apply)
      ~ is_shareable                        = false -> (known after apply)
      ~ is_volume_created_during_launch     = false -> (known after apply)
      + iscsi_login_state                   = (known after apply)
      ~ multipath_devices                   = [] -> (known after apply)
      + port                                = (known after apply)
      ~ state                               = "ATTACHED" -> (known after apply)
      ~ time_created                        = "2026-03-27 11:30:40.109 +0000 UTC" -> (known after apply)
      + use_chap                            = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # oci_identity_dynamic_group.this will be updated in-place
  ~ resource "oci_identity_dynamic_group" "this" {
        id             = "ocid1.dynamicgroup.oc1..aaaaaaaaxep7ntfhuk7cuhcgnmyvgjag2fhhbxoefyveb4kdz2npzrsypusq"
      ~ matching_rule  = "instance.id = 'ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7acaandzi2umb3j3sqzk6krker4tf67vukhlsqthe77tjxq'" -> (known after apply)
        name           = "oci-apps"
        # (6 unchanged attributes hidden)
    }

  # oci_load_balancer_backend.traefik must be replaced
-/+ resource "oci_load_balancer_backend" "traefik" {
      ~ drain            = false -> (known after apply)
      ~ id               = "loadBalancers/ocid1.loadbalancer.oc1.uk-london-1.aaaaaaaakgjfvnm67avsld5nuuabjxago6nwzr6ssogd5b65zgxdcwvx7xxa/backendSets/traefik/backends/172.16.0.30:80" -> (known after apply)
      ~ ip_address       = "172.16.0.30" -> (known after apply) # forces replacement
      + max_connections  = (known after apply)
      ~ name             = "172.16.0.30:80" -> (known after apply)
      ~ offline          = false -> (known after apply)
      ~ state            = "SUCCEEDED" -> (known after apply)
      ~ weight           = 1 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/infisical-agent.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content                    = "075b0c26faff38f1fa951b07196a41e1" -> "8057a62b6875e6a531df7b32b0424077" # forces replacement
      ~ content_length             = "803" -> (known after apply)
      ~ content_md5                = "B1sMJvr/OPH6lRsHGWpB4Q==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Finfisical-agent.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "6917d582-f8e6-4939-970d-c73bace5305e" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/traefik.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content                    = "6bada3dfa580ea618c5aa26bec1e6896" -> "e609db04dcc9d61869290f90e94ce133" # forces replacement
      ~ content_length             = "577" -> (known after apply)
      ~ content_md5                = "a62j36WA6mGMWqJr7B5olg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Ftraefik.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "63abc83d-f70d-4d0e-a649-182a4a7469ec" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/podcasts-cleanup.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content                    = "2b4cd9439bcba189794202cf7761f146" -> "b2563b3a20a04802e4c8ad5d794ba49d" # forces replacement
      ~ content_length             = "332" -> (known after apply)
      ~ content_md5                = "K0zZQ5vLoYl5QgLPd2HxRg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fpodcasts-cleanup.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "2b703c70-3e86-4760-a60d-d334a0ff8d1c" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # tailscale_tailnet_key.this will be replaced due to changes in replace_triggered_by
-/+ resource "tailscale_tailnet_key" "this" {
      ~ created_at    = "2026-03-27T11:29:54Z" -> (known after apply)
      ~ expires_at    = "2026-03-27T11:39:54Z" -> (known after apply)
      ~ id            = "kG8jmkcM8r11CNTRL" -> (known after apply)
      ~ invalid       = true -> (known after apply)
      ~ key           = (sensitive value)
        tags          = [
            "tag:oci",
        ]
      + user_id       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 8 to add, 1 to change, 8 to destroy.

```